tutorials/swak4Foam/groovyBC/circulatingSplash/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    floor
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    atmosphere
    {
        type            groovyBC;
        valueExpression "-(alpha1+internalField(alpha1))*0.5*normal()";
        value           uniform (0 0 0);
    }
    spill
    {
//         type groovyBC;
//         valueExpression "vector(0,0,0)";
//         gradientExpression "vector(0,0,0)";
//         fractionExpression "(phi>0) ? ((alpha1>1e-3) ? 0 : 0.5) : 1";
         type            pressureInletOutletVelocity;
         phi             phi;
         value           uniform (0 0 0);
    }
    sides
    {
//         type groovyBC;
//         valueExpression "vector(0,0,0)";
//         gradientExpression "vector(0,0,0)";
//         fractionExpression "(phi>0) ? ((alpha1>1e-3) ? 0 : 0.5) : 1";
         type            pressureInletOutletVelocity;
         phi             phi;
         value           uniform (0 0 0);
    }
}

// ************************************************************************* //
