tutorials/swak4Foam/groovyBC/circulatingSplash/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      motionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh      dynamicRefineFvMesh;

// Refinement
dynamicRefineFvMeshCoeffs
{
    // Refine every refineInterval timesteps
    refineInterval 1;

    // volScalarField to base refinement on
    field alpha1;

    //
    // 1. interpolate field
    // 2. mark any cell
    //    - using a point value >minLevel <maxLevel
    //    - level < maxRefinement
    //    - unprotected
    // 3. if too many cells determine cost function:
    //    - lowest level wins
    //    - cell closest to (0.5*minLevel + 0.5*maxLevel) wins

    // Which cells to un/refine: based on point values (simple averaging).
    // - refine pointCells of point value > refineLevel
    // - unrefine pointCells of point value < unrefineLevel and that
    //   are not within nBufferLayers of points marked for refinement.

    // All cells (neighbouring a cell with) gamma get refined
    lowerRefineLevel 0.001;
    upperRefineLevel 0.999;
    // All points are candidates for unrefining (gamma always <1)
    unrefineLevel 10;
    nBufferLayers 1;

    // Maximum refinement level (starts from 0)
    maxRefinement 2;

    // Maximum cell limit (approximate)
    maxCells 500000;

    // Fluxes to correct and variable they can be interpolated from
    correctFluxes ((phi U));

    // Write cellLevel?
    dumpLevel true;
}

// ************************************************************************* //
